blueprints/infosat/sap/request_xml/sap_invoices_supplier_by_date.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:glob="http://sap.com/xi/SAPGlobal20/Global">
    <soapenv:Header />
    <soapenv:Body>
        <glob:SupplierInvoiceSimpleByElementsQueryMBF_sync>
            <SupplierInvoiceSimpleSelectionByElements>
                
                <!--Zero or more repetitions:-->

                <!-- <SelectionByDate>
                    <InclusionExclusionCode>I</InclusionExclusionCode>
                    <IntervalBoundaryTypeCode>3</IntervalBoundaryTypeCode>
                    <LowerBoundaryDate>{{startdate}}</LowerBoundaryDate>
                    <UpperBoundaryDate>{{enddate}}</UpperBoundaryDate>
                </SelectionByDate> -->

                <SelectionByTransactionDate>
                    <!--Optional:-->
                    <InclusionExclusionCode>I</InclusionExclusionCode>
                    <IntervalBoundaryTypeCode>3</IntervalBoundaryTypeCode>
                    <!--Optional:-->
                    <LowerBoundaryTransactionDate>{{startdate}}</LowerBoundaryTransactionDate>
                    <!--Optional:-->
                    <UpperBoundaryTransactionDate>{{enddate}}</UpperBoundaryTransactionDate>
                 </SelectionByTransactionDate>

                
            </SupplierInvoiceSimpleSelectionByElements>
            <ProcessingConditions>
            <!--Optional:-->
            <QueryHitsMaximumNumberValue>10000</QueryHitsMaximumNumberValue>
            <QueryHitsUnlimitedIndicator>false</QueryHitsUnlimitedIndicator>
            <!--Optional:-->
            <LastReturnedObjectID schemeID="?" schemeVersionID="?" schemeAgencyID="?" schemeAgencySchemeID="?" schemeAgencySchemeAgencyID="?">?</LastReturnedObjectID>
            </ProcessingConditions>
        </glob:SupplierInvoiceSimpleByElementsQueryMBF_sync>
    </soapenv:Body>
</soapenv:Envelope>